app/views/aperos/show.html.erb

  <b>User:</b>
  <%= User.find(@apero.user_id).email %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  <b>Category:</b>
  <%= Category.find(@apero.category_id).name %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1