app/controllers/aperos_controller.rb

SELECT "aperos".* FROM "aperos"
---
  def index

    @aperos = Apero.all

SELECT "aperos".* FROM "aperos" WHERE "aperos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @apero = Apero.find(params[:id])

SELECT "aperos".* FROM "aperos" WHERE "aperos"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @apero = Apero.find(params[:id])

INSERT INTO "aperos" ("category_id", "content", "created_at", "date", "hour", "name", "updated_at", "user_id", "visibility") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @apero = Apero.new(params[:apero])
	@apero.user_id = current_user.id

    respond_to do |format|
      if @apero.save

SELECT "aperos".* FROM "aperos" WHERE "aperos"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "aperos" SET "date" = '2013-05-31', "hour" = '2000-01-01 07:56:00.000000', "updated_at" = '2013-05-31 11:00:19.957159' WHERE "aperos"."id" = 12
---
  def update
    @apero = Apero.find(params[:id])

    respond_to do |format|
      if @apero.update_attributes(params[:apero])

SELECT "aperos".* FROM "aperos" WHERE "aperos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "aperos" WHERE "aperos"."id" = ?  [["id", 1]]
---
  def destroy
    @apero = Apero.find(params[:id])
    @apero.destroy